freesbeeGE/test/dati/g/test8Esterno.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"  xmlns:ge="http://ge.freesbee.unibas.it/">
    <SOAP-ENV:Body>
        <ge:pubblicaMessaggio>
            <messaggioSoap>
                <confermaPubblicatori>
                    <pubblicatore>
                        <nomePubblicatore>P</nomePubblicatore>
                        <tipoPubblicatore>SPC</tipoPubblicatore>
                    </pubblicatore>
                    <pubblicatore>
                        <nomePubblicatore>Q</nomePubblicatore>
                        <tipoPubblicatore>SPC</tipoPubblicatore>
                    </pubblicatore>
                    <categoriaSottoscrizione>Test2</categoriaSottoscrizione>
                </confermaPubblicatori>
            </messaggioSoap>
            <nomePubblicatore>NICA_PUGLIA</nomePubblicatore>
            <tipoPubblicatore>SPC</tipoPubblicatore>
            <categoriaEventi>GEControlProtocol</categoriaEventi>
        </ge:pubblicaMessaggio>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>